ir_version: 7
producer_name: "OnnxMLTools+onnx_optimizer"
producer_version: "1.7.0+0.6"
model_version: 0
graph {
  name: "combine_model"
  node {
    input: "image_shape"
    output: "combine_model_tfnodes_yolo_evaluation_layer_1_squeeze_0"
    name: "TFNodes/yolo_evaluation_layer_1/Squeeze"
    op_type: "Squeeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "input_1"
    input: "W74"
    input: "combine_model_convolution_output74.opt.bias"
    output: "combine_model_convolution_output74"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Const_2:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_6/shape:0"
    output: "combine_model_tfnodes_yolo_evaluation_layer_1_reshape_6_0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_6"
    op_type: "Reshape"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Const_4:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape_12/shape:0"
    output: "combine_model_tfnodes_yolo_evaluation_layer_1_reshape_12_0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape_12"
    op_type: "Reshape"
  }
  node {
    input: "TFNodes/yolo_evaluation_layer_1/Const:0"
    input: "TFNodes/yolo_evaluation_layer_1/Reshape/shape:0"
    output: "combine_model_tfnodes_yolo_evaluation_layer_1_reshape_0"
    name: "TFNodes/yolo_evaluation_layer_1/Reshape"
    op_type: "Reshape"
  }
  node {
    input: "combine_model_tfnodes_yolo_evaluation_layer_1_squeeze_0"
    input: "combine_model_tfnodes_yolo_evaluation_layer_1_squeeze_0"
    output: "combine_model_tfnodes_yolo_evaluation_layer_1_concat_8_0"
    name: "TFNodes/yolo_evaluation_layer_1/concat_8"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "combine_model_tfnodes_yolo_evaluation_layer_1_squeeze_0"
    input: "combine_model_tfnodes_yolo_evaluation_layer_1_squeeze_0"
    output: "combine_model_tfnodes_yolo_evaluation_layer_1_concat_5_0"
    name: "TFNodes/yolo_evaluation_layer_1/concat_5"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "combine_model_tfnodes_yolo_evaluation_layer_1_squeeze_0"
    input: "combine_model_tfnodes_yolo_evaluation_layer_1_squeeze_0"
    output: "combine_model_tfnodes_yolo_evaluation_layer_1_concat_2_0"
    name: "TFNodes/yolo_evaluation_layer_1/concat_2"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "combine_model_convolution_output74"
    output: "combine_model_leaky_re_lu_1_leakyrelu_0"
    name: "leaky_re_lu_1"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_1_leakyrelu_0"
    input: "W71"
    input: "combine_model_convolution_output71.opt.bias"
    output: "combine_model_convolution_output71"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output71"
    output: "combine_model_leaky_re_lu_2_leakyrelu_0"
    name: "leaky_re_lu_2"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_2_leakyrelu_0"
    input: "W73"
    input: "combine_model_convolution_output73.opt.bias"
    output: "combine_model_convolution_output73"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output73"
    output: "combine_model_leaky_re_lu_3_leakyrelu_0"
    name: "leaky_re_lu_3"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_3_leakyrelu_0"
    input: "W72"
    input: "combine_model_convolution_output72.opt.bias"
    output: "combine_model_convolution_output72"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output72"
    output: "combine_model_leaky_re_lu_4_leakyrelu_0"
    name: "leaky_re_lu_4"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_2_leakyrelu_0"
    input: "combine_model_leaky_re_lu_4_leakyrelu_0"
    output: "combine_model_add_1_add_0"
    name: "Add22"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_1_add_0"
    input: "W67"
    input: "combine_model_convolution_output67.opt.bias"
    output: "combine_model_convolution_output67"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output67"
    output: "combine_model_leaky_re_lu_5_leakyrelu_0"
    name: "leaky_re_lu_5"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_5_leakyrelu_0"
    input: "W70"
    input: "combine_model_convolution_output70.opt.bias"
    output: "combine_model_convolution_output70"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output70"
    output: "combine_model_leaky_re_lu_6_leakyrelu_0"
    name: "leaky_re_lu_6"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_6_leakyrelu_0"
    input: "W68"
    input: "combine_model_convolution_output68.opt.bias"
    output: "combine_model_convolution_output68"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output68"
    output: "combine_model_leaky_re_lu_7_leakyrelu_0"
    name: "leaky_re_lu_7"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_5_leakyrelu_0"
    input: "combine_model_leaky_re_lu_7_leakyrelu_0"
    output: "combine_model_add_2_add_0"
    name: "Add21"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_2_add_0"
    input: "W69"
    input: "combine_model_convolution_output69.opt.bias"
    output: "combine_model_convolution_output69"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output69"
    output: "combine_model_leaky_re_lu_8_leakyrelu_0"
    name: "leaky_re_lu_8"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_8_leakyrelu_0"
    input: "W66"
    input: "combine_model_convolution_output66.opt.bias"
    output: "combine_model_convolution_output66"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output66"
    output: "combine_model_leaky_re_lu_9_leakyrelu_0"
    name: "leaky_re_lu_9"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_2_add_0"
    input: "combine_model_leaky_re_lu_9_leakyrelu_0"
    output: "combine_model_add_3_add_0"
    name: "Add20"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_3_add_0"
    input: "W57"
    input: "combine_model_convolution_output57.opt.bias"
    output: "combine_model_convolution_output57"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output57"
    output: "combine_model_leaky_re_lu_10_leakyrelu_0"
    name: "leaky_re_lu_10"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_10_leakyrelu_0"
    input: "W65"
    input: "combine_model_convolution_output65.opt.bias"
    output: "combine_model_convolution_output65"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output65"
    output: "combine_model_leaky_re_lu_11_leakyrelu_0"
    name: "leaky_re_lu_11"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_11_leakyrelu_0"
    input: "W58"
    input: "combine_model_convolution_output58.opt.bias"
    output: "combine_model_convolution_output58"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output58"
    output: "combine_model_leaky_re_lu_12_leakyrelu_0"
    name: "leaky_re_lu_12"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_10_leakyrelu_0"
    input: "combine_model_leaky_re_lu_12_leakyrelu_0"
    output: "combine_model_add_4_add_0"
    name: "Add19"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_4_add_0"
    input: "W63"
    input: "combine_model_convolution_output63.opt.bias"
    output: "combine_model_convolution_output63"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output63"
    output: "combine_model_leaky_re_lu_13_leakyrelu_0"
    name: "leaky_re_lu_13"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_13_leakyrelu_0"
    input: "W52"
    input: "combine_model_convolution_output52.opt.bias"
    output: "combine_model_convolution_output52"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output52"
    output: "combine_model_leaky_re_lu_14_leakyrelu_0"
    name: "leaky_re_lu_14"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_4_add_0"
    input: "combine_model_leaky_re_lu_14_leakyrelu_0"
    output: "combine_model_add_5_add_0"
    name: "Add17"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_5_add_0"
    input: "W61"
    input: "combine_model_convolution_output61.opt.bias"
    output: "combine_model_convolution_output61"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output61"
    output: "combine_model_leaky_re_lu_15_leakyrelu_0"
    name: "leaky_re_lu_15"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_15_leakyrelu_0"
    input: "W48"
    input: "combine_model_convolution_output48.opt.bias"
    output: "combine_model_convolution_output48"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output48"
    output: "combine_model_leaky_re_lu_16_leakyrelu_0"
    name: "leaky_re_lu_16"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_5_add_0"
    input: "combine_model_leaky_re_lu_16_leakyrelu_0"
    output: "combine_model_add_6_add_0"
    name: "Add15"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_6_add_0"
    input: "W59"
    input: "combine_model_convolution_output59.opt.bias"
    output: "combine_model_convolution_output59"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output59"
    output: "combine_model_leaky_re_lu_17_leakyrelu_0"
    name: "leaky_re_lu_17"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_17_leakyrelu_0"
    input: "W43"
    input: "combine_model_convolution_output43.opt.bias"
    output: "combine_model_convolution_output43"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output43"
    output: "combine_model_leaky_re_lu_18_leakyrelu_0"
    name: "leaky_re_lu_18"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_6_add_0"
    input: "combine_model_leaky_re_lu_18_leakyrelu_0"
    output: "combine_model_add_7_add_0"
    name: "Add13"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_7_add_0"
    input: "W53"
    input: "combine_model_convolution_output53.opt.bias"
    output: "combine_model_convolution_output53"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output53"
    output: "combine_model_leaky_re_lu_19_leakyrelu_0"
    name: "leaky_re_lu_19"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_19_leakyrelu_0"
    input: "W38"
    input: "combine_model_convolution_output38.opt.bias"
    output: "combine_model_convolution_output38"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output38"
    output: "combine_model_leaky_re_lu_20_leakyrelu_0"
    name: "leaky_re_lu_20"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_7_add_0"
    input: "combine_model_leaky_re_lu_20_leakyrelu_0"
    output: "combine_model_add_8_add_0"
    name: "Add11"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_8_add_0"
    input: "W49"
    input: "combine_model_convolution_output49.opt.bias"
    output: "combine_model_convolution_output49"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output49"
    output: "combine_model_leaky_re_lu_21_leakyrelu_0"
    name: "leaky_re_lu_21"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_21_leakyrelu_0"
    input: "W34"
    input: "combine_model_convolution_output34.opt.bias"
    output: "combine_model_convolution_output34"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output34"
    output: "combine_model_leaky_re_lu_22_leakyrelu_0"
    name: "leaky_re_lu_22"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_8_add_0"
    input: "combine_model_leaky_re_lu_22_leakyrelu_0"
    output: "combine_model_add_9_add_0"
    name: "Add9"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_9_add_0"
    input: "W44"
    input: "combine_model_convolution_output44.opt.bias"
    output: "combine_model_convolution_output44"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output44"
    output: "combine_model_leaky_re_lu_23_leakyrelu_0"
    name: "leaky_re_lu_23"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_23_leakyrelu_0"
    input: "W29"
    input: "combine_model_convolution_output29.opt.bias"
    output: "combine_model_convolution_output29"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output29"
    output: "combine_model_leaky_re_lu_24_leakyrelu_0"
    name: "leaky_re_lu_24"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_9_add_0"
    input: "combine_model_leaky_re_lu_24_leakyrelu_0"
    output: "combine_model_add_10_add_0"
    name: "Add6"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_10_add_0"
    input: "W39"
    input: "combine_model_convolution_output39.opt.bias"
    output: "combine_model_convolution_output39"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output39"
    output: "combine_model_leaky_re_lu_25_leakyrelu_0"
    name: "leaky_re_lu_25"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_25_leakyrelu_0"
    input: "W26"
    input: "combine_model_convolution_output26.opt.bias"
    output: "combine_model_convolution_output26"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output26"
    output: "combine_model_leaky_re_lu_26_leakyrelu_0"
    name: "leaky_re_lu_26"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_10_add_0"
    input: "combine_model_leaky_re_lu_26_leakyrelu_0"
    output: "combine_model_add_11_add_0"
    name: "Add3"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_11_add_0"
    input: "W54"
    input: "combine_model_convolution_output54.opt.bias"
    output: "combine_model_convolution_output54"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output54"
    output: "combine_model_leaky_re_lu_27_leakyrelu_0"
    name: "leaky_re_lu_27"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_27_leakyrelu_0"
    input: "W64"
    input: "combine_model_convolution_output64.opt.bias"
    output: "combine_model_convolution_output64"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output64"
    output: "combine_model_leaky_re_lu_28_leakyrelu_0"
    name: "leaky_re_lu_28"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_28_leakyrelu_0"
    input: "W55"
    input: "combine_model_convolution_output55.opt.bias"
    output: "combine_model_convolution_output55"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output55"
    output: "combine_model_leaky_re_lu_29_leakyrelu_0"
    name: "leaky_re_lu_29"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_27_leakyrelu_0"
    input: "combine_model_leaky_re_lu_29_leakyrelu_0"
    output: "combine_model_add_12_add_0"
    name: "Add18"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_12_add_0"
    input: "W62"
    input: "combine_model_convolution_output62.opt.bias"
    output: "combine_model_convolution_output62"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output62"
    output: "combine_model_leaky_re_lu_30_leakyrelu_0"
    name: "leaky_re_lu_30"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_30_leakyrelu_0"
    input: "W50"
    input: "combine_model_convolution_output50.opt.bias"
    output: "combine_model_convolution_output50"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output50"
    output: "combine_model_leaky_re_lu_31_leakyrelu_0"
    name: "leaky_re_lu_31"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_12_add_0"
    input: "combine_model_leaky_re_lu_31_leakyrelu_0"
    output: "combine_model_add_13_add_0"
    name: "Add16"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_13_add_0"
    input: "W60"
    input: "combine_model_convolution_output60.opt.bias"
    output: "combine_model_convolution_output60"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output60"
    output: "combine_model_leaky_re_lu_32_leakyrelu_0"
    name: "leaky_re_lu_32"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_32_leakyrelu_0"
    input: "W46"
    input: "combine_model_convolution_output46.opt.bias"
    output: "combine_model_convolution_output46"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output46"
    output: "combine_model_leaky_re_lu_33_leakyrelu_0"
    name: "leaky_re_lu_33"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_13_add_0"
    input: "combine_model_leaky_re_lu_33_leakyrelu_0"
    output: "combine_model_add_14_add_0"
    name: "Add14"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_14_add_0"
    input: "W56"
    input: "combine_model_convolution_output56.opt.bias"
    output: "combine_model_convolution_output56"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output56"
    output: "combine_model_leaky_re_lu_34_leakyrelu_0"
    name: "leaky_re_lu_34"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_34_leakyrelu_0"
    input: "W41"
    input: "combine_model_convolution_output41.opt.bias"
    output: "combine_model_convolution_output41"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output41"
    output: "combine_model_leaky_re_lu_35_leakyrelu_0"
    name: "leaky_re_lu_35"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_14_add_0"
    input: "combine_model_leaky_re_lu_35_leakyrelu_0"
    output: "combine_model_add_15_add_0"
    name: "Add12"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_15_add_0"
    input: "W51"
    input: "combine_model_convolution_output51.opt.bias"
    output: "combine_model_convolution_output51"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output51"
    output: "combine_model_leaky_re_lu_36_leakyrelu_0"
    name: "leaky_re_lu_36"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_36_leakyrelu_0"
    input: "W36"
    input: "combine_model_convolution_output36.opt.bias"
    output: "combine_model_convolution_output36"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output36"
    output: "combine_model_leaky_re_lu_37_leakyrelu_0"
    name: "leaky_re_lu_37"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_15_add_0"
    input: "combine_model_leaky_re_lu_37_leakyrelu_0"
    output: "combine_model_add_16_add_0"
    name: "Add10"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_16_add_0"
    input: "W47"
    input: "combine_model_convolution_output47.opt.bias"
    output: "combine_model_convolution_output47"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output47"
    output: "combine_model_leaky_re_lu_38_leakyrelu_0"
    name: "leaky_re_lu_38"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_38_leakyrelu_0"
    input: "W33"
    input: "combine_model_convolution_output33.opt.bias"
    output: "combine_model_convolution_output33"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output33"
    output: "combine_model_leaky_re_lu_39_leakyrelu_0"
    name: "leaky_re_lu_39"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_16_add_0"
    input: "combine_model_leaky_re_lu_39_leakyrelu_0"
    output: "combine_model_add_17_add_0"
    name: "Add8"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_17_add_0"
    input: "W42"
    input: "combine_model_convolution_output42.opt.bias"
    output: "combine_model_convolution_output42"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output42"
    output: "combine_model_leaky_re_lu_40_leakyrelu_0"
    name: "leaky_re_lu_40"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_40_leakyrelu_0"
    input: "W28"
    input: "combine_model_convolution_output28.opt.bias"
    output: "combine_model_convolution_output28"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output28"
    output: "combine_model_leaky_re_lu_41_leakyrelu_0"
    name: "leaky_re_lu_41"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_17_add_0"
    input: "combine_model_leaky_re_lu_41_leakyrelu_0"
    output: "combine_model_add_18_add_0"
    name: "Add5"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_18_add_0"
    input: "W37"
    input: "combine_model_convolution_output37.opt.bias"
    output: "combine_model_convolution_output37"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output37"
    output: "combine_model_leaky_re_lu_42_leakyrelu_0"
    name: "leaky_re_lu_42"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_42_leakyrelu_0"
    input: "W24"
    input: "combine_model_convolution_output24.opt.bias"
    output: "combine_model_convolution_output24"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output24"
    output: "combine_model_leaky_re_lu_43_leakyrelu_0"
    name: "leaky_re_lu_43"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_add_18_add_0"
    input: "combine_model_leaky_re_lu_43_leakyrelu_0"
    output: "combine_model_add_19_add_0"
    name: "Add2"
    op_type: "Add"
    domain: ""
  }
  node {
    input: "combine_model_add_19_add_0"
    input: "W30"
    input: "combine_model_convolution_output30.opt.bias"
    output: "combine_model_convolution_output30"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "combine_model_convolution_output30"
    output: "combine_model_leaky_re_lu_44_leakyrelu_0"
    name: "leaky_re_lu_44"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.10000000149011612
      type: FLOAT
    }
    doc_string: ""
    domain: ""
  }
  node {
    input: "combine_model_leaky_re_lu_44_leakyrelu_0"
    input: "W45"
    input: "combine_model_convolution_output45.opt.bias"
    output: "combine_model_convolution_output45"
    op_type: "Conv"
    attribute {
      name: "auto_pad"
      s: "SAME_UPPER"
      type: STRING
